# 误差和方差

如下图，当运行一个学习算法时，如果这个算法的表现不理想，那么多半是出现两种情况：
要么是偏差比较大(欠拟合)，要么是方差比较大（过拟合）。

能判断出现的情况是这两种情况中的哪一种非常重要，因为它是一个很有效的指示器，
告诉我们可以改进算法的最有效的方法和途径。

![](http://images2015.cnblogs.com/blog/788978/201604/788978-20160416213113738-43890851.png)

沿用之前所使用的训练集误差和验证集误差的定义也就是平方误差，画出下图.

![](http://images2015.cnblogs.com/blog/788978/201604/788978-20160416213114098-1355895486.png)
* 如果d等于1，意味着用一个很简单的函数来拟合数据，此时我们不能很好地拟合训练集(欠拟合)
* d等于2，那么我们会得到一个更小的交叉验证误差，因为我们找了一个能够更好拟合数据的次数。
d等于1是用线性函数来进行拟合，而在最右边的这个图表示更高次数的多项式的拟合情况。
* d的值取为4 ，那么我们又过拟合了，我们又会得到一个较大的交叉验证误差。
